scripts/exp2/redis-sls-10-10.txt
====== PING_INLINE ======
  100000 requests completed in 9.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.31% <= 0.4 milliseconds
2.91% <= 0.5 milliseconds
9.59% <= 0.6 milliseconds
18.75% <= 0.7 milliseconds
28.28% <= 0.8 milliseconds
35.84% <= 0.9 milliseconds
38.74% <= 1.0 milliseconds
39.21% <= 1.1 milliseconds
39.57% <= 1.2 milliseconds
40.63% <= 1.3 milliseconds
42.73% <= 1.4 milliseconds
45.05% <= 1.5 milliseconds
47.42% <= 1.6 milliseconds
49.81% <= 1.7 milliseconds
52.18% <= 1.8 milliseconds
54.55% <= 1.9 milliseconds
56.92% <= 2.0 milliseconds
59.27% <= 2.1 milliseconds
59.27% <= 2 milliseconds
70.72% <= 3 milliseconds
70.79% <= 4 milliseconds
70.83% <= 5 milliseconds
71.71% <= 6 milliseconds
77.81% <= 7 milliseconds
87.29% <= 8 milliseconds
87.80% <= 9 milliseconds
87.84% <= 10 milliseconds
87.93% <= 11 milliseconds
90.48% <= 12 milliseconds
93.90% <= 13 milliseconds
93.98% <= 14 milliseconds
94.01% <= 15 milliseconds
94.10% <= 16 milliseconds
94.36% <= 17 milliseconds
94.81% <= 18 milliseconds
94.91% <= 19 milliseconds
94.96% <= 20 milliseconds
95.00% <= 21 milliseconds
96.59% <= 22 milliseconds
99.79% <= 23 milliseconds
99.86% <= 25 milliseconds
99.88% <= 26 milliseconds
99.91% <= 31 milliseconds
99.93% <= 32 milliseconds
99.96% <= 36 milliseconds
100.00% <= 36 milliseconds
10590.98 requests per second

====== PING_BULK ======
  100000 requests completed in 9.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

40.31% <= 1 milliseconds
57.67% <= 2 milliseconds
70.17% <= 3 milliseconds
70.27% <= 4 milliseconds
70.29% <= 5 milliseconds
71.03% <= 6 milliseconds
77.56% <= 7 milliseconds
87.39% <= 8 milliseconds
87.87% <= 10 milliseconds
87.89% <= 11 milliseconds
90.56% <= 12 milliseconds
94.10% <= 13 milliseconds
94.22% <= 14 milliseconds
94.25% <= 16 milliseconds
94.36% <= 17 milliseconds
94.84% <= 18 milliseconds
94.99% <= 19 milliseconds
95.00% <= 21 milliseconds
96.88% <= 22 milliseconds
99.82% <= 23 milliseconds
99.92% <= 24 milliseconds
99.93% <= 31 milliseconds
99.95% <= 32 milliseconds
99.97% <= 33 milliseconds
99.98% <= 35 milliseconds
100.00% <= 35 milliseconds
10658.71 requests per second

====== SET ======
  100000 requests completed in 9.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

39.17% <= 1 milliseconds
56.47% <= 2 milliseconds
69.69% <= 3 milliseconds
69.84% <= 5 milliseconds
70.60% <= 6 milliseconds
78.02% <= 7 milliseconds
87.44% <= 8 milliseconds
87.99% <= 9 milliseconds
88.01% <= 10 milliseconds
88.05% <= 11 milliseconds
90.47% <= 12 milliseconds
94.83% <= 13 milliseconds
95.00% <= 15 milliseconds
95.04% <= 16 milliseconds
95.15% <= 17 milliseconds
95.39% <= 18 milliseconds
95.53% <= 19 milliseconds
95.55% <= 20 milliseconds
95.56% <= 21 milliseconds
96.93% <= 22 milliseconds
99.81% <= 23 milliseconds
99.96% <= 31 milliseconds
99.99% <= 32 milliseconds
100.00% <= 32 milliseconds
10720.41 requests per second

====== GET ======
  100000 requests completed in 9.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

39.58% <= 1 milliseconds
56.53% <= 2 milliseconds
69.80% <= 3 milliseconds
69.86% <= 4 milliseconds
69.88% <= 5 milliseconds
70.69% <= 6 milliseconds
78.09% <= 7 milliseconds
87.63% <= 8 milliseconds
88.06% <= 9 milliseconds
88.09% <= 10 milliseconds
88.11% <= 11 milliseconds
90.68% <= 12 milliseconds
94.50% <= 13 milliseconds
94.68% <= 14 milliseconds
94.69% <= 15 milliseconds
94.69% <= 16 milliseconds
94.78% <= 17 milliseconds
95.01% <= 18 milliseconds
95.22% <= 19 milliseconds
95.24% <= 20 milliseconds
95.24% <= 21 milliseconds
96.74% <= 22 milliseconds
99.87% <= 23 milliseconds
100.00% <= 23 milliseconds
10700.91 requests per second

====== INCR ======
  100000 requests completed in 9.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

40.59% <= 1 milliseconds
56.90% <= 2 milliseconds
70.21% <= 3 milliseconds
70.31% <= 4 milliseconds
70.34% <= 5 milliseconds
71.02% <= 6 milliseconds
77.97% <= 7 milliseconds
87.34% <= 8 milliseconds
87.72% <= 9 milliseconds
87.84% <= 10 milliseconds
87.90% <= 11 milliseconds
90.78% <= 12 milliseconds
95.79% <= 13 milliseconds
96.00% <= 14 milliseconds
96.04% <= 15 milliseconds
96.06% <= 16 milliseconds
96.16% <= 17 milliseconds
96.40% <= 18 milliseconds
96.43% <= 19 milliseconds
96.45% <= 20 milliseconds
96.48% <= 21 milliseconds
97.51% <= 22 milliseconds
99.85% <= 23 milliseconds
100.00% <= 23 milliseconds
11031.44 requests per second

====== LPUSH ======
  100000 requests completed in 12.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

19.28% <= 1 milliseconds
41.66% <= 2 milliseconds
63.04% <= 3 milliseconds
63.74% <= 4 milliseconds
64.79% <= 5 milliseconds
66.52% <= 6 milliseconds
71.76% <= 7 milliseconds
73.66% <= 8 milliseconds
73.81% <= 9 milliseconds
73.81% <= 10 milliseconds
73.82% <= 11 milliseconds
75.15% <= 12 milliseconds
79.07% <= 13 milliseconds
79.59% <= 14 milliseconds
81.42% <= 15 milliseconds
85.22% <= 16 milliseconds
93.75% <= 17 milliseconds
98.16% <= 18 milliseconds
98.49% <= 20 milliseconds
98.49% <= 21 milliseconds
98.64% <= 22 milliseconds
99.45% <= 23 milliseconds
99.88% <= 24 milliseconds
99.91% <= 25 milliseconds
99.95% <= 26 milliseconds
100.00% <= 26 milliseconds
7759.16 requests per second

====== RPUSH ======
  100000 requests completed in 9.09 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

15.50% <= 1 milliseconds
45.62% <= 2 milliseconds
71.44% <= 3 milliseconds
76.99% <= 4 milliseconds
84.38% <= 5 milliseconds
85.41% <= 6 milliseconds
85.61% <= 7 milliseconds
85.64% <= 9 milliseconds
85.65% <= 10 milliseconds
85.67% <= 11 milliseconds
87.33% <= 12 milliseconds
93.10% <= 13 milliseconds
94.47% <= 14 milliseconds
95.83% <= 15 milliseconds
96.50% <= 16 milliseconds
97.10% <= 17 milliseconds
97.46% <= 18 milliseconds
97.51% <= 21 milliseconds
97.81% <= 22 milliseconds
98.94% <= 23 milliseconds
99.96% <= 24 milliseconds
100.00% <= 24 milliseconds
11003.52 requests per second

====== LPOP ======
  100000 requests completed in 8.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

13.55% <= 1 milliseconds
43.65% <= 2 milliseconds
72.27% <= 3 milliseconds
78.64% <= 4 milliseconds
86.71% <= 5 milliseconds
87.31% <= 6 milliseconds
87.37% <= 7 milliseconds
87.38% <= 8 milliseconds
87.42% <= 9 milliseconds
87.47% <= 10 milliseconds
87.48% <= 11 milliseconds
89.42% <= 12 milliseconds
96.06% <= 13 milliseconds
97.42% <= 14 milliseconds
97.81% <= 15 milliseconds
97.89% <= 16 milliseconds
97.92% <= 17 milliseconds
97.94% <= 19 milliseconds
97.94% <= 20 milliseconds
97.96% <= 21 milliseconds
98.23% <= 22 milliseconds
99.41% <= 23 milliseconds
99.95% <= 24 milliseconds
100.00% <= 24 milliseconds
11636.03 requests per second

====== RPOP ======
  100000 requests completed in 3.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

82.65% <= 1 milliseconds
88.89% <= 2 milliseconds
94.37% <= 3 milliseconds
95.51% <= 4 milliseconds
97.19% <= 5 milliseconds
97.44% <= 9 milliseconds
97.50% <= 10 milliseconds
97.50% <= 11 milliseconds
97.81% <= 12 milliseconds
99.01% <= 13 milliseconds
99.25% <= 14 milliseconds
99.27% <= 15 milliseconds
99.35% <= 17 milliseconds
99.36% <= 21 milliseconds
99.37% <= 22 milliseconds
99.61% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 24 milliseconds
25766.55 requests per second

====== SADD ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.58% <= 1 milliseconds
99.86% <= 2 milliseconds
99.93% <= 3 milliseconds
99.97% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
37495.31 requests per second

====== HSET ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.90% <= 1 milliseconds
100.00% <= 1 milliseconds
37721.61 requests per second

====== SPOP ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.75% <= 1 milliseconds
99.92% <= 2 milliseconds
99.96% <= 3 milliseconds
99.96% <= 5 milliseconds
99.97% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
37693.18 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.91% <= 1 milliseconds
100.00% <= 1 milliseconds
38095.24 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.28 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.39% <= 1 milliseconds
99.93% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
30525.03 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
98.61% <= 2 milliseconds
99.97% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
17882.69 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
98.95% <= 2 milliseconds
99.88% <= 3 milliseconds
99.91% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
14242.99 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
53.94% <= 2 milliseconds
99.91% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
12553.35 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.57% <= 1 milliseconds
99.87% <= 2 milliseconds
99.94% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
37078.23 requests per second